// 2) Дано три сортированных возрастающих массива([1, 3, 5, 8, 8, 10], [0, 4, 5, 11, 12], [2, 5, 7, 15]).
//   Найти в них во всех любое совпадающее число.
//   Сложность алгоритма не должна превышать О(n + m + p) //где n,m,p - длина соответствующего массива
//
//
// Мое решение:
// Реализовать не смог, но дошел до идеи, что должно быть три переменные(для каждого массива - для индекса),
// которые мы поочередно инкрементируем, если на текущем этапе число при сравнении всех значений по индексу
// (переменным) это число оказалось наименьшим из трех.
